Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G17B.tmx
Source language: en_us
Languages: zh_cn

source: President Obama's Father: A 'Bold And Reckless Life'
zh_cn: 奥巴马总统的父亲：无畏而鲁莽的一生

source: President Obama is the son of a white American mother and a black Kenyan father who met at the University of Hawaii in 1960.
zh_cn: 奥巴马总统的父亲是一位祖籍肯尼亚的黑人，母亲是美国白人，他们于1960年相识于夏威夷大学。

source: The president last saw his father when he was 10, when Obama Sr. made a brief visit to Hawaii from Kenya, where he moved when the future president was just a toddler.
zh_cn: 奥巴马总统最后一次见他的父亲是在他10岁的时候。那时，老奥巴马从肯尼亚造访夏威夷并做了短暂的逗留，而此时，未来的总统还是一个蹒跚学步的孩子。

source: But what was Barack Obama Sr. really like?
zh_cn: 但是，老奥巴马的真实生活又是怎样的呢？

source: Biographer Sally H. Jacobs takes an in-depth look at his life - and his legacy - in The Other Barack: The Bold and Reckless Life of President Obama's Father.
zh_cn: 在《另一巴拉克：奥巴马总统的父亲无畏而鲁莽的一生》这本书中，传记作家Sally H. Jacobs深入挖掘他的生活以及他的遗产。

source: The Childhood Of Barack Obama Sr.
zh_cn: Jacobs tel老奥巴马的童年

source: Jacobs tells Fresh Air's Dave Davies that the president's father grew up in an extremely strict household.
zh_cn: Jacobs告诉脱口秀节目Fresh Air的主持人Dave Davies，总统的父亲出生在一个家教非常严格的家庭。

source: His father, Onyango, who later changed his name to Hussein, regularly beat his wives and children with a four-pronged whip.
zh_cn: 他的父亲（即奥巴马总统的祖父）——原名叫奥尼安戈，后来改成了侯赛因——经常用长长的皮鞭抽打他的妻子和孩子。

source: He also forced his children to recite long lists of memorized facts before their meals.
zh_cn: 他还经常强迫孩子们饭前背诵一些琐事。

source: "Barack Obama Sr. would have to recite his math tables while standing at the table before he could have any food," Jacobs says. "[Math] was a relatively new concept for Onyango ... and he wanted his son to have this skill."
zh_cn: “老奥巴马不得不站在餐桌旁背诵数学公式表，否则便不能吃饭” ，Jacobs说， “对奥尼安戈来说，数学是个比较新的概念，他希望自己的孩子能够掌握这一技能”。

source: And when Obama Sr. later went to the village school, he was immediately recognized for his strong math abilities.
zh_cn: 后来当老奥巴马去村庄里的学校读书的时候，因扎实的数学基础立刻便脱颖而出。

source: "A principal described him to me as the smartest boy in the school," says Jacobs. "He was particularly good at math, even then.
zh_cn: Jacobs接着说“校长告诉我他是学校里最聪明的孩子”，“当时即使他特别小，他特别擅长数学，精于计算。

source: That would become his trademark and he would go on to become an economist, but even as a boy he excelled with numbers."
zh_cn: 这几乎成了他的闪光点，似乎注定成为一名经济学人”。

source: In 1959, Obama Sr. went to study at the University of Hawaii, Manoa, in Honolulu, where he stood out for his fastidious dressing habits, his forays into public speaking and his fabulous dancing skills.
zh_cn: 1959年，老奥巴马赴坐落于火奴鲁鲁市马诺阿的夏威夷大学读书。在那里，他凭借极为讲究的穿着习惯、公共场合即兴演讲和优美的舞姿而崭露头角。

source: "A woman who had known him in Hawaii told me of how she ... would go down to some of the famous nightclubs with him and start to dance," says Jacobs.
zh_cn: Jacobs又说“一位在夏威夷就认识他的女士告诉我她是怎么追随老奥巴马去著名的酒吧跳舞”。

source: "And everybody would watch because he was so beautiful on the floor - and also because he was a black man.
zh_cn: “在酒吧，每一个人都会看他跳舞，一方面由于他的舞步非常优美，另一方面由于他是一个黑人。

source: Blacks were very few in number in Honolulu and he was the first African student at the University of Hawaii."
zh_cn: 当时，火奴鲁鲁黑人很少，而在夏威夷大学他是第一个非洲裔学生”。

source: Meeting Stanley Ann Dunham
zh_cn: 邂逅Stanley Ann Dunham

source: A year after Obama Sr. enrolled at the university, he met Stanley Ann Dunham, a 17-year-old from Kansas who was studying Russian.
zh_cn: 老奥巴马入学一年后，在校园遇见Stanley Ann Dunham----来自美国堪萨斯州的17岁女孩。那时，她在夏威夷大学学习俄语。

source: "Both of them were quite taken with each other," says Jacobs. "This relationship picked up speed pretty quickly.
zh_cn: “他们两个很谈的来”， Jacobs说，“这种恋爱关系升温很快。

source: The president describes it in his own memoir [Dreams from My Father] of how drawn they were to each other.
zh_cn: 奥巴马总统在他的回忆录《我父亲的梦想》一书中描写了他们是如何爱慕对方。

source: [And] in a fairly short time, she becomes pregnant."
zh_cn: 不久，她就怀孕了。”

source: Obama Sr. told Dunham that he had divorced Kezia Aoko, his wife in Africa, but that wasn't true.
zh_cn: 老奥巴马告诉Dunham他应经同她非洲的妻子Kezia Aoko,离婚，但是事实并非如此。

source: He also did not reveal that he had had two children with Aoko, who, like Obama Sr., was a member of the Luo ethnic group.
zh_cn: 他也没有告诉Dunham他和Aoko育有两个孩子。Aoko和老奥巴马都是Luo”部落的成员，这个部落对离婚讳莫如深。

source: If Obama the president had had [Barack Obama Sr.] as a father, I think it's fair to say that he wouldn't be the president."The thing you have to understand about this is that it was deeply rooted in Luo culture," says Jacobs. "Divorce wasn't common.
zh_cn: "如果奥巴马总统由老奥巴马抚养成人，我想很有可能他当选不了美国总统——传记作家Biographer Sally H. Jacobs。“关于这点，你要理解的东西已经根深蒂固于Luo部落文化” ，Jacobs说，“在Luo部落中，离婚并不常见。

source: You could get a divorce but you had to go through a very complex process which involved the couple sitting before a council of elders and then there had to be a return of the dowry."
zh_cn: 你可以离婚，但是必须经历一个复杂的过程。其中包括夫妻双方同长辈开个座谈会，然后还要返还嫁妆”。

source: Later on, Obama Sr. told immigration officials that he thought of himself as divorced in Kenya before he arrived in the United States.
zh_cn: 此后不久，老奥巴马告诉移民局的官员在他到达美国之前已经在肯尼亚离婚。

source: Jacobs says that Obama Sr.'s immigration files also show that Obama Sr. and Dunham may have considered putting President Obama up for adoption before he was born.
zh_cn: Jacobs说老奥巴马的移民文件也表明，在奥巴马总统出生之前，老奥巴马和Dunham可能就已经考虑将他送人领养。

source: "I [made a Freedom of Information Act request for] his immigration file because I wanted to confirm the date he arrived in the United States," she says. "In this record, there was an extraordinary memo in which the foreign student adviser at the University of Hawaii has ... realized [Obama Sr.] might have two wives."
zh_cn: 因为我想证实他到达美国后的那些资料”，她说，“这份记录文件中有一个特别的备忘录，其中记录了夏威夷大学的外籍学生顾问可能意识到了老奥巴马可能有两个妻子”。

source: In the adviser's memo, she noted that she had asked Obama Sr. about his family situation.
zh_cn: 在备忘录中，她写道她询问过老奥巴马的家庭情况。

source: "And he says, 'Don't worry, my wife is pregnant.
zh_cn: “他回答说:”别担心，我妻子怀孕了。

source: But she's making arrangements with the Salvation Army to give the baby up,' " says Jacobs. "Now did that really happen? It's not clear.
zh_cn: 但是她已经同救世军安排好了进行流产。”Jacobs说，“真的进行流产了吗？我们无从而知。

source: Members of the family on both sides say they've never heard of it ... [But] Obama Sr. had every reason to not want to have that baby in his life at the time.
zh_cn: 双方的家庭成员称从未听说过此事。但是从当时的情况来看，老奥巴马有充足的理由不要这个孩子。

source: He was, at the time, up for the renewal of his visa.
zh_cn: 当时，他的签证正在申请续期。

source: The last thing they were going to look kindly on, if they chose to see it this way, was a bigamist with a mixed-race baby.
zh_cn: 如果像双方的家庭成员所说的那样，他们做的最后一件事将会是宽容的对待一个育有混种族婴儿的重婚者。

source: So Obama Sr. would say that the baby was going to vanish and that baby would be the [future] president of the United States."
zh_cn: 因此，老奥巴马说他将会流产这个孩子，这个孩子将成为未来的美国总统。”

source: The Birth of Barack Obama Jr.
zh_cn: 小奥巴马的出生

source: Of course, that baby didn't vanish.
zh_cn: 当然了，这个婴儿并未胎死腹中。

source: Shortly after Dunham gave birth to Barack Obama Jr. on Aug. 4, 1961, in Honolulu, she moved with him to Seattle.
zh_cn: Dunham在1961年8月4号在火奴鲁鲁生下小奥巴马，随后不久她就带着这个刚出生的婴儿搬到了西雅图。

source: Obama Sr. stayed in Hawaii, leaving a year later to go to Harvard University for a graduate fellowship in economics.
zh_cn: 老奥巴马则继续留在夏威夷，一年之后参加了哈佛大学的一个研究生协会，攻读经济学。

source: In 1964, Dunham filed for divorce.
zh_cn: 1964年，Dunham签署了离婚文件。

source: That same year, Obama Sr. returned to Kenya, which had just obtained its independence the year before, and got a job in management at Shell.
zh_cn: 同年老奥巴马回到肯尼亚，得到一份在Shell公司的管理工作。而此时的肯尼亚则刚刚独立一年。

source: "Obama [Sr.] makes it less than a year," says Jacobs. "He wasn't fired exactly, but he was not asked back.
zh_cn: “老奥巴马在Shell公司工作不到一年” ，Jacobs说，“他没有被炒鱿鱼，但是也没有让他继续回来工作。

source: So he left Shell and gets another potentially terrific job - this one at the Central Bank of Kenya.
zh_cn: 因此他离开了Shell公司，并且谋到一份很有发展空间的工作——任职于肯尼亚的中央银行。

source: Again, he runs into trouble within months.
zh_cn: 可是，好景不长，几个月后，他再次陷入麻烦。

source: He shows up late, he drinks on the job, he has to borrow money and he is asked to leave."
zh_cn: 他上班迟到，工作时候喝酒，并且不得不借钱，因此被辞退”。

source: Obama Sr. returned to the U.S. in 1971 because his life was falling apart.
zh_cn: 由于老奥巴马的在肯尼亚的生活面临崩溃，他于1971年重返美国。

source: A third wife was planning to leave him, he had no job and he had suffered massive injuries in a car accident.
zh_cn: 他的第三任妻子即将离他而去，也没有工作，并且此时的他因车祸而伤痕累累。

source: He spent a short amount of time with his son Barack Jr. in Hawaii and then returned to Kenya, where a second car crash cost him his legs.
zh_cn: 在夏威夷与其儿子短暂的会面之后又返回肯尼亚。在肯尼亚，第二次车祸中丧失了双腿。

source: In 1982, Obama Sr. was in a third car accident and died from his injuries.
zh_cn: 1982年，老奥巴马发生了第三次车祸，因伤势太重而丧生。

source: All of Obama Sr.'s children, Jacobs says, have had to come to terms with their complicated relationships with their father.
zh_cn: Jacobs说老奥巴马的所有的孩子达成一致，理清与其父错综复杂的关系。

source: Five of his children have written soul-searching memoirs about Obama Sr., including the president's 1995 memoir, Dreams from My Father.
zh_cn: 五个孩子都发自内心的写了对其父亲的回忆录，其中包括1995年奥巴马总统的《我父亲的梦想》。
